bmourit/ArduinoCore-GD32/cores/arduino/gd32/timer.c
#if defined(TIMER1)
void TIMER1_IRQHandler(void)
{
    timerinterrupthandle(TIMER1);
}
#endif /* TIMER1 handler */

#if defined(TIMER2)
void TIMER2_IRQHandler(void)
{
    timerinterrupthandle(TIMER2);
}
#endif /* TIMER2 handler */

#if defined(TIMER3)
void TIMER3_IRQHandler(void)
{
    timerinterrupthandle(TIMER3);
}
#endif /* TIMER3 handler */

#if defined(TIMER4)
void TIMER4_IRQHandler(void)
{
    timerinterrupthandle(TIMER4);
}
#endif /* TIMER4 handler */

#if defined(TIMER5) && !defined(NO_TIMER_5)
void TIMER5_IRQHandler(void)
{
    timerinterrupthandle(TIMER5);
}

/* interrupt handler name for multiple F1x0, E50, F3x0, F4xx,.. chips */
void TIMER5_DAC_IRQHandler(void) {
    timerinterrupthandle(TIMER5);
}
#endif /* TMER5 handler */

#if defined(TIMER6)
void TIMER6_IRQHandler(void)
{
    timerinterrupthandle(TIMER6);
}
#endif /* TIMER6 handler */

#if defined(TIMER7)
void TIMER7_IRQHandler(void)
{
    timerinterrupthandle(TIMER7);
#if defined(TIMER12)
    timerinterrupthandle(TIMER12);
#endif
}

void TIMER7_Channel_IRQHandler(void)
{
    timerinterrupthandle(TIMER7);
}
#endif /* TIMER7/TIMER12 handler */

#if defined(TIMER8)
void TIMER8_IRQHandler(void)
{
    timerinterrupthandle(TIMER8);
}
#endif /* TIMER8 handler */

#if defined(TIMER9) && !defined(TIMER0)
void TIMER9_IRQHandler(void)
{
    timerinterrupthandle(TIMER9);
}
#endif /* TIMER9 handler */

#if defined(TIMER10)
void TIMER10_IRQHandler(void)
{
    timerinterrupthandle(TIMER10);
}
#endif /* TIMER10 handler */

#if defined(TIMER11)
void TIMER11_IRQHandler(void)
{
    timerinterrupthandle(TIMER11);
}
#endif /* TIMER11 handler */

#if defined(TIMER12) && !defined (TIMER7)
void TIMER12_IRQHandler(void)
{
    timerinterrupthandle(TIMER12);
}
#endif /* TIMER12 handler */

#if defined(TIMER13)
void TIMER13_IRQHandler(void)
{
    timerinterrupthandle(TIMER13);
}
#endif /* TIMER13 handler */

#if defined(TIMER14)
void TIMER14_IRQHandler(void)
{
    timerinterrupthandle(TIMER14);
}
#endif

#if defined(TIMER15)
void TIMER15_IRQHandler(void)
{
    timerinterrupthandle(TIMER15);
}
#endif

#if defined(TIMER16)
void TIMER16_IRQHandler(void)
{
    timerinterrupthandle(TIMER16);
}
#endif
